---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBendingRadius
source: html/e645dfff-bd07-8997-fd4f-be08cffbfcf0.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBendingRadius Method

Gets the current bending radius of the rebar.

## Syntax (C#)
```csharp
public double GetBendingRadius()
```

## Returns
Returns the current bending radius of the rebar.